Today, we will focus on learning about Pandas DataFrame and data manipulation — the backbone of many data operation tasks. We're going to handle the Titanic dataset — a fascinating example containing real-world data — that will keep you engaged as we navigate through the lesson.

Pandas DataFrames bring versatility and power to the table when it comes to data manipulation. Think of it as Excel, but on steroids, capable of handling large and complex datasets. The processing abilities of DataFrames are crucial for cleaning, transforming, and analyzing datasets in earnest.

Say you've got a dataset, like the Titanic, but some data is missing. Or perhaps there are some anomalies you’d want to filter out. Or you need specific segments of data to examine a particular hypothesis. How would you do it? By mastering Pandas DataFrames, you'd be well-equipped to tackle these tasks!

### Initiation to Pandas DataFrame
Pandas DataFrame is a two-dimensional labeled data structure capable of holding data of various types—integers, floats, strings, Python objects, and more. It's generally the most commonly used Pandas object.

Let's start simply by creating a DataFrame from a dictionary:

In [2]:
import pandas as pd
student_dict = {'Name':["Rahul","Siya","Manish"], 'Age':[18,19,18], 'City': ["New York", "Los Angeles", "Berlin"]}

student_df = pd.DataFrame(student_dict)

print(student_df)

     Name  Age         City
0   Rahul   18     New York
1    Siya   19  Los Angeles
2  Manish   18       Berlin

Each key-value pair in the dictionary corresponds to a column in the resulting DataFrame. The key defines the column label, and the corresponding value is a list of column values. The DataFrame constructor takes a dictionary as input and turns it into a two-dimensional table where keys become column names, and values in each key (which should be a list) will be the values for the respective column. Here "John", "Anna", and "Peter" have ages 28, 24, and 33, respectively, and they live in "New York", "Los Angeles", and "Berlin".

DataFrame Characteristics
To inspect the structure and properties of a DataFrame, we have a range of functions at our disposal. Here are some commonly used ones:

df.head(n): Returns the first n rows of the DataFrame df.
df.tail(n): Returns the last n rows of the DataFrame df.
df.shape: Returns a tuple representing the dimensions (number_of_rows, number_of_columns) of the DataFrame df.
df.columns: Returns an index containing column labels of the DataFrame df.
df.dtypes: Returns a series with the data type of each column.
Let's see these functions in action below:

Python
Copy
Play
print(df.head(2))  # Print first

In [15]:
print("Head of Dataframe : \n",student_df.head(2))

Head of Dataframe :
     Name  Age         City
0  Rahul   18     New York
1   Siya   19  Los Angeles

In [16]:
print("Tail of Dataframe:\n", student_df.tail(2))

Tail of Dataframe:
      Name  Age         City
1    Siya   19  Los Angeles
2  Manish   18       Berlin

In [17]:
print(student_df.dtypes)

Name    object
Age      int64
City    object
dtype: object

In [18]:
print(student_df.shape)

(3, 3)

In [21]:
print(student_df.columns)

Index(['Name', 'Age', 'City'], dtype='object')

In [20]:
print(student_df.describe())

             Age
count   3.000000
mean   18.333333
std     0.577350
min    18.000000
25%    18.000000
50%    18.000000
75%    18.500000
max    19.000000

Using λ (Lambda) for DataFrame Manipulation
The apply() function in Pandas is a versatile tool to manipulate DataFrame values. It allows us to apply a function (either a Python built-in function or a custom function) along the DataFrame's axes (either row-wise or column-wise).

Let's demonstrate this by adding a new column to our DataFrame, which represents whether a person is considered youthful by applying a lambda function to the "Age" column.

Lambda functions, λ (Lambda), in Python, are small anonymous functions that are defined with the lambda keyword. They can take any number of arguments and can only have one expression. They are particularly useful when you need to pass a small function as an argument.

In [22]:
student_df["IsAbove18"] = student_df["Age"].apply(lambda age:"Yes" if age > 18 else "No")
student_df

     Name  Age         City IsAbove18
0   Rahul   18     New York        No
1    Siya   19  Los Angeles       Yes
2  Manish   18       Berlin        No

In the above example, we used a lambda function that takes an age as an argument and returns "Yes" if the age is above 18 and "No" otherwise.

The Mighty Concat
Pandas provides various ways to combine DataFrames, one of which is concat(). As the name implies, concat() combines DataFrame objects along a particular axis.

Let's create a new DataFrame and concatenate it with our existing DataFrame:

In [32]:
new_student_dict = {'Name':['Riya','Sushant'],'Age' : [19,20],'City':['Pune','Mumbai'],'IsAbove18':['Yes','Yes']}
new_student_df = pd.DataFrame(new_student_dict)

## Concant the existing dataframe with the new dataframe.
concat_df = pd.concat([student_df,new_student_df],ignore_index=True)
concat_df

      Name  Age         City IsAbove18
0    Rahul   18     New York        No
1     Siya   19  Los Angeles       Yes
2   Manish   18       Berlin        No
3     Riya   19         Pune       Yes
4  Sushant   20       Mumbai       Yes

Did you notice the ignore_index=True parameter? When set to True, it resets the index in the resulting DataFrame. So, in the resultant DataFrame, the indices are in increasing order starting from 0.

Locating Elements in a Pandas DataFrame
Pandas provides several ways to locate elements in a DataFrame.

The simplest way to select a column in a DataFrame is by label:

In [34]:
print("Age Column \n",concat_df['Age'])

Age Column
 0    18
1    19
2    18
3    19
4    20
Name: Age, dtype: int64

In [36]:
#Fetch multiple columns from a dataframe
print("Multiple columns in dataframe :\n",concat_df[['Name','Age']])

Multiple columns in dataframe :
       Name  Age
0    Rahul   18
1     Siya   19
2   Manish   18
3     Riya   19
4  Sushant   20

To select elements within the DataFrame by integer location, we use the iloc method. The iloc indexer is like Python list slicing. This accepts integer inputs and slice notation. The general syntax is df.iloc[row_selection, column_selection]:

For example, if we wish to select the value in the second row (indexed at 1) and the first column (indexed at 0):

In [44]:
#print(concat_df)
print("The value at second row of first column is:",concat_df.iloc[1,0])

# Select the first two rows and all columns
print(concat_df.iloc[0:2,:])

# Select the first two row and two  columns
print(concat_df.iloc[0:2,0:2])

The value at second row of first column is: Siya
    Name  Age         City IsAbove18
0  Rahul   18     New York        No
1   Siya   19  Los Angeles       Yes
    Name  Age
0  Rahul   18
1   Siya   19

Exploring Practical Application of Pandas: Titanic Dataset from Seaborn
Let's dive in and see how Pandas can be applied to real-life datasets! To show this, we will use the Titanic dataset provided by the Seaborn library and show you some quick examples of how you can start analyzing it using Pandas.

Seaborn provides a direct function to load the dataset, making it very easy to load the dataset into the Pandas DataFrame:

In [45]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [46]:
titanic.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [52]:
titanic['IsChild'] = titanic['age'].apply(lambda x:"Yes" if x <= 10.0 else "No")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,IsChild
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,No
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,No
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,No
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,No
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,No
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,No
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,No
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,No
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,No
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,No

In [58]:
total_number_of_children = titanic[titanic['IsChild'] == "Yes"].count()[0]
total_number_of_children

64

Topic Introduction and Actualization
Welcome to the next leg of our journey with the Titanic Survival Data - wielding the power of Descriptive Statistics with Numpy and Pandas! In this lesson, we will cover how to use both these libraries to perform descriptive statistical analysis on our dataset. By the end of this lesson, you will have gained the ability to calculate measures of central tendencies such as mean, median, and mode and understand how to interpret measures of variability, quartiles, and percentiles.

Why should we care about learning descriptive statistics? Well, simply put, descriptive statistics provide powerful, informative summaries of our data, allowing us to understand the nature and distribution of our data even before embarking on any form of machine learning or data prediction. Armed with this understanding, we are better equipped to carry out accurate analyses and produce meaningful insights from our data. Ready to investigate the Titanic dataset more thoroughly? Then, let's dive in!

Descriptive statistics are appropriately named, as they provide insights into the main features of our data. Let's start with the Titanic dataset and calculate some basic statistics for the age of passengers: the mean, median, and mode.

In [59]:
mean_age = titanic['age'].mean()
mean_age

29.69911764705882

In [60]:
median_age = titanic['age'].median()
median_age

28.0

In [62]:
mode_age = titanic['age'].mode()[0]
mode_age

24.0

Measures of Variability: Standard Deviation
Apart from measures of central tendency, there is another important style of measurement in statistics - measures of dispersion (variability). One of the common ways to gauge the variability in a dataset is via the standard deviation, which measures how much the values in a dataset vary around the mean. A super low standard deviation indicates a dataset with values clustered around the mean, while a higher standard deviation represents a wider spread around the mean. For our Titanic dataset, we can calculate the standard deviation of age as follows:

In [63]:
var = titanic['age'].var()
var

211.01912474630802

In [64]:
#std_dev = np.sqrt(var)

std_dev = titanic['age'].std()
std_dev

14.526497332334042

Delving Deeper into Data: Quartiles and Percentiles
Let's dig deeper and start looking at the division of data into segments with quartiles and percentiles. Quartiles and percentiles are in essence, a way to cut our data into equal segments. The 25th percentile, for example, is equivalent to the first quartile, and the 75th percentile is the third quartile.

In [74]:
# Quartiles and percentiles
import numpy as np
# Using Numpy
Q1_age_np = np.percentile(titanic['age'].dropna(), 25) # dropna is being used to drop NA values
Q3_age_np = np.percentile(titanic['age'].dropna(), 75)

print(f"First quartile of age (Numpy): {Q1_age_np}")
print(f"Third quartile of age (Numpy): {Q3_age_np}")

# Output:
# First quartile of age (Numpy): 20.125
# Third quartile of age (Numpy): 38.0

# Using Pandas
Q1_age_pd = titanic['age'].quantile(0.25)
Q3_age_pd = titanic['age'].quantile(0.75)

print(f"First quartile of age (Pandas): {Q1_age_pd}")
print(f"Third quartile of age (Pandas): {Q3_age_pd}")

# Output:
# First quartile of age (Pandas): 20.125
# Third quartile of age (Pandas): 38.0

First quartile of age (Numpy): 20.125
Third quartile of age (Numpy): 38.0
First quartile of age (Pandas): 20.125
Third quartile of age (Pandas): 38.0

In [70]:
titanic['age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [73]:
print("First Quartile of age", titanic['age'].describe()[4])
print("Second Quartile of age", titanic['age'].describe()[5])
print("Third Quartile of age", titanic['age'].describe()[6])

First Quartile of age 20.125
Second Quartile of age 28.0
Third Quartile of age 38.0

The executed Python code first calculates and prints the first and third quartiles for the age column of our Titanic dataset using NumPy. It then repeats the calculation using Pandas, giving the same results. With these quartiles, we can immediately understand more about the age distribution of passengers on board the Titanic. For instance, we now know that 50% of passengers were between the ages of Q1_age_np (around 20 years old) and Q3_age_np (approximately 38 years old).

## Groupping and Aggregation

In [79]:
# Sample data
data = {
    'City': ['New York', 'Chicago', 'New York', 'Chicago', 'Chicago'],
    'Year': [2018, 2018, 2019, 2019, 2018],
    'Revenue': [10000, 15000, 12000, 18000, 9000],
    'Expenses': [5000, 6000, 4500, 7000, 3000]
}

df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

Original DataFrame:
       City  Year  Revenue  Expenses
0  New York  2018    10000      5000
1   Chicago  2018    15000      6000
2  New York  2019    12000      4500
3   Chicago  2019    18000      7000
4   Chicago  2018     9000      3000

In [87]:
grouped = df.groupby(['City','Year']).agg({'Revenue':'mean','Expenses':'sum'})
grouped

               Revenue  Expenses
City     Year
Chicago  2018  12000.0      9000
         2019  18000.0      7000
New York 2018  10000.0      5000
         2019  12000.0      4500

In [88]:
grouped2 = df.groupby(['City']).count()
grouped2

          Year  Revenue  Expenses
City
Chicago      3        3         3
New York     2        2         2

## Sorting DataFrame

In [93]:
sorted_df = df.sort_values(by='Revenue')
print(df)
print("\n")
print(sorted_df)

       City  Year  Revenue  Expenses
0  New York  2018    10000      5000
1   Chicago  2018    15000      6000
2  New York  2019    12000      4500
3   Chicago  2019    18000      7000
4   Chicago  2018     9000      3000


       City  Year  Revenue  Expenses
4   Chicago  2018     9000      3000
0  New York  2018    10000      5000
2  New York  2019    12000      4500
1   Chicago  2018    15000      6000
3   Chicago  2019    18000      7000

## Reshapping DataFrame


**pivot a DataFrame from long to wide format in pandas**

In [102]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df2 = pd.DataFrame(data)


pivot_df = df2.pivot(index='Name',columns='City', values='Age')
pivot_df

City     Chicago  Los Angeles  New York
Name
Alice        NaN          NaN      25.0
Bob          NaN         30.0       NaN
Charlie     35.0          NaN       NaN

In [104]:
def double_age(age):
    return age * 2

df2['Double_Age'] = df2['Age'].apply(double_age)
print(df2)

      Name  Age         City  Double_Age
0    Alice   25     New York          50
1      Bob   30  Los Angeles          60
2  Charlie   35      Chicago          70

## Merging DataFrame

 In pandas, merging refers to combining data from different sources based on a common attribute or column. There are several types of merges you can perform in pandas, primarily controlled by the how parameter. Here are examples illustrating different types of merges:

In [115]:
# Example DataFrame 1
df1 = pd.DataFrame({
    'employee': ['Bob', 'Jake', 'Lisa', 'Sue','Priya'],
    'group': ['Accounting', 'Engineering', 'Engineering', 'HR', 'HR']
})

# Example DataFrame 2
df2 = pd.DataFrame({
    'employee': ['Lisa', 'Bob', 'Jake', 'Sue','Siya'],
    'hire_date': [2004, 2008, 2012, 2014,2002]
})

print(df1)
print("\n")
print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4    Priya           HR


  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
4     Siya       2002

**Inner Merge**
An inner merge (default behavior) combines rows where the key columns (in this case, 'employee') are identical in both DataFrames:

In [116]:
inner_merge = pd.merge(df1, df2, on='employee')
print(inner_merge)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

**Left Merge**
A left merge includes all rows from the left DataFrame (df1), plus matching rows from the right DataFrame (df2). Non-matching rows in df2 will have NaN values:

In [117]:
left_merge = pd.merge(df1,df2, on='employee', how='left')
left_merge

  employee        group  hire_date
0      Bob   Accounting     2008.0
1     Jake  Engineering     2012.0
2     Lisa  Engineering     2004.0
3      Sue           HR     2014.0
4    Priya           HR        NaN

**Right Merge**
A right merge includes all rows from the right DataFrame (df2), plus matching rows from the left DataFrame (df1). Non-matching rows in df1 will have NaN values:

In [118]:
right_merge = pd.merge(df1,df2, on='employee', how='right')
right_merge

  employee        group  hire_date
0     Lisa  Engineering       2004
1      Bob   Accounting       2008
2     Jake  Engineering       2012
3      Sue           HR       2014
4     Siya          NaN       2002

**Outer Merge**
An outer merge includes all rows from both DataFrames, with NaN for missing values where there is no match:

In [119]:
outer_merge = pd.merge(df1,df2,on='employee', how='outer')
outer_merge

  employee        group  hire_date
0      Bob   Accounting     2008.0
1     Jake  Engineering     2012.0
2     Lisa  Engineering     2004.0
3      Sue           HR     2014.0
4    Priya           HR        NaN
5     Siya          NaN     2002.0

In [121]:
times_series_df = pd.DataFrame({
    'Date':['16-02-2000','17-04-1997','11-03-1968','07-10-1972'],
    'Values':[33,87,90,45]
})

times_series_df

         Date  Values
0  16-02-2000      33
1  17-04-1997      87
2  11-03-1968      90
3  07-10-1972      45

In [122]:
times_series_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    4 non-null      object
 1   Values  4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [124]:
times_series_df['Date'] = pd.to_datetime(times_series_df['Date'])
times_series_df['Date'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 4 entries, 0 to 3
Series name: Date
Non-Null Count  Dtype
--------------  -----
4 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 160.0 bytes

**Handling Categorical Data**
Question: How can you encode categorical variables in pandas?

In [126]:
print(df1)
encoded_df = pd.get_dummies(df1,columns=['group'])
print("\n")
print(encoded_df)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4    Priya           HR


  employee  group_Accounting  group_Engineering  group_HR
0      Bob                 1                  0         0
1     Jake                 0                  1         0
2     Lisa                 0                  1         0
3      Sue                 0                  0         1
4    Priya                 0                  0         1

## Predict the fare by using Linear Regression

In [127]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,IsChild
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,No
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,No
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,No
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,No
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,No
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,No
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,No
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,No
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,No
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,No

In [ ]:
import sklearn